glcloud/keil_v5/ARM/PACK/.Web/NXP.MIMXRT1064_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.5" Csub="lpuart_edma" condition="device.MIMXRT1064_driver.lpuart">
      <description>LPUART Driver</description>
      <files>
        <file name="drivers/fsl_lpuart_edma.c" category="sourceC"/>
        <file name="drivers/fsl_lpuart_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="pit" condition="device.MIMXRT1064_driver.common">
      <description>PIT Driver</description>
      <files>
        <file name="drivers/fsl_pit.c" category="sourceC"/>
        <file name="drivers/fsl_pit.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="pmu" condition="device.MIMXRT1064">
      <description>pmu Driver</description>
      <files>
        <file name="drivers/fsl_pmu.c" category="sourceC"/>
        <file name="drivers/fsl_pmu.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="pwm" condition="device.MIMXRT1064_driver.common">
      <description>PWM Driver</description>
      <files>
        <file name="drivers/fsl_pwm.c" category="sourceC"/>
        <file name="drivers/fsl_pwm.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="pxp" condition="device.MIMXRT1064_driver.common">
      <description>PXP Driver</description>
      <files>
        <file name="drivers/fsl_pxp.c" category="sourceC"/>
        <file name="drivers/fsl_pxp.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="qtmr" condition="device.MIMXRT1064_driver.common">
      <description>QTMR Driver</description>
      <files>
        <file name="drivers/fsl_qtmr.c" category="sourceC"/>
        <file name="drivers/fsl_qtmr.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="rtwdog" condition="device.MIMXRT1064_driver.common">
      <description>RTWDOG Driver</description>
      <files>
        <file name="drivers/fsl_rtwdog.c" category="sourceC"/>
        <file name="drivers/fsl_rtwdog.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.4" Csub="sai" condition="device.MIMXRT1064_driver.common">
      <description>SAI Driver</description>
      <files>
        <file name="drivers/fsl_sai.c" category="sourceC"/>
        <file name="drivers/fsl_sai.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.4" Csub="sai_edma" condition="device.MIMXRT1064_driver.sai">
      <description>SAI Driver</description>
      <files>
        <file name="drivers/fsl_sai_edma.c" category="sourceC"/>
        <file name="drivers/fsl_sai_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.4" Csub="semc" condition="device.MIMXRT1064_driver.common">
      <description>SEMC Driver</description>
      <files>
        <file name="drivers/fsl_semc.c" category="sourceC"/>
        <file name="drivers/fsl_semc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="snvs_hp" condition="device.MIMXRT1064_driver.common">
      <description>SNVS HP Driver</description>
      <files>
        <file name="drivers/fsl_snvs_hp.c" category="sourceC"/>
        <file name="drivers/fsl_snvs_hp.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="snvs_lp" condition="device.MIMXRT1064_driver.common">
      <description>SNVS LP Driver</description>
      <files>
        <file name="drivers/fsl_snvs_lp.c" category="sourceC"/>
        <file name="drivers/fsl_snvs_lp.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="spdif" condition="device.MIMXRT1064_driver.common">
      <description>SPDIF Driver</description>
      <files>
        <file name="drivers/fsl_spdif.c" category="sourceC"/>
        <file name="drivers/fsl_spdif.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="spdif_edma" condition="device.MIMXRT1064_driver.edma_driver.spdif">
      <description>SPDIF Driver</description>
      <files>
        <file name="drivers/fsl_spdif_edma.c" category="sourceC"/>
        <file name="drivers/fsl_spdif_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="src" condition="device.MIMXRT1064">
      <description>SRC Driver</description>
      <files>
        <file name="drivers/fsl_src.c" category="sourceC"/>
        <file name="drivers/fsl_src.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="tempmon" condition="device.MIMXRT1064_driver.common">
      <description>TEMPMON Driver</description>
      <files>
        <file name="drivers/fsl_tempmon.c" category="sourceC"/>
        <file name="drivers/fsl_tempmon.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="trng" condition="device.MIMXRT1064_driver.common">
      <description>TRNG Driver</description>
      <files>
        <file name="drivers/fsl_trng.c" category="sourceC"/>
        <file name="drivers/fsl_trng.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="tsc" condition="device.MIMXRT1064">
      <description>TSC Driver</description>
      <files>
        <file name="drivers/fsl_tsc.c" category="sourceC"/>
        <file name="drivers/fsl_tsc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.4" Csub="sdhc" condition="device.MIMXRT1064">
      <description>USDHC Driver</description>
      <files>
        <file name="drivers/fsl_usdhc.c" category="sourceC"/>
        <file name="drivers/fsl_usdhc.h" category="header"/>
      </files>
    </component>
