glcloud/keil_v5/ARM/PACK/.Web/NXP.MIMXRT1064_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="wdog" condition="device.MIMXRT1064_driver.common">
      <description>wdog01 Driver</description>
      <files>
        <file name="drivers/fsl_wdog.c" category="sourceC"/>
        <file name="drivers/fsl_wdog.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.3" Csub="xbara" condition="device.MIMXRT1064_driver.common">
      <description>XBARA Driver</description>
      <files>
        <file name="drivers/fsl_xbara.c" category="sourceC"/>
        <file name="drivers/fsl_xbara.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="xbarb" condition="device.MIMXRT1064_driver.common">
      <description>XBARB Driver</description>
      <files>
        <file name="drivers/fsl_xbarb.c" category="sourceC"/>
        <file name="drivers/fsl_xbarb.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="xip" condition="devices.MIMXRT1064">
      <description>XIP Driver</description>
      <RTE_Components_h>
#define XIP_BOOT_HEADER_ENABLE 1
#define XIP_BOOT_HEADER_DCD_ENABLE 1
#define XIP_EXTERNAL_FLASH 1
		</RTE_Components_h>
      <files>
        <file name="xip/evkmimxrt1064_flexspi_nor_config.c" category="sourceC"/>
        <file name="xip/evkmimxrt1064_flexspi_nor_config.h" category="header"/>
        <file name="xip/evkmimxrt1064_sdram_ini_dcd.c" category="sourceC"/>
        <file name="xip/evkmimxrt1064_sdram_ini_dcd.h" category="header"/>
        <file name="xip/fsl_flexspi_nor_boot.c" category="sourceC"/>
        <file name="xip/fsl_flexspi_nor_boot.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Cversion="1.0.0" Csub="RTE_Device" condition="device.MIMXRT1064_driver.edma">
      <description></description>
      <files>
        <file name="template/RTE_Device.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Cversion="1.0.0" Csub="assert" condition="device.MIMXRT1064_utility.debug_console">
      <description></description>
      <files>
        <file name="utilities/fsl_assert.c" category="sourceC"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Cversion="1.0.0" Csub="debug_console" condition="device.MIMXRT1064">
      <description></description>
      <files>
        <file name="utilities/fsl_debug_console.c" category="sourceC"/>
        <file name="utilities/fsl_debug_console.h" category="header"/>
        <file name="utilities/fsl_debug_console_conf.h" category="header"/>
        <file name="utilities/io/fsl_io.c" category="sourceC"/>
        <file name="utilities/io/fsl_io.h" category="header"/>
        <file name="utilities/log/fsl_log.c" category="sourceC"/>
        <file name="utilities/log/fsl_log.h" category="header"/>
        <file name="utilities/str/fsl_str.c" category="sourceC"/>
        <file name="utilities/str/fsl_str.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Cversion="1.0.0" Csub="debug_console_swo" condition="device.MIMXRT1064_utility.debug_console">
      <description></description>
      <files>
        <file name="utilities/io/swo/fsl_swo.c" category="sourceC"/>
        <file name="utilities/io/swo/fsl_swo.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Cversion="1.0.0" Csub="notifier" condition="device.MIMXRT1064_driver.common">
      <description></description>
      <files>
        <file name="utilities/fsl_notifier.c" category="sourceC"/>
        <file name="utilities/fsl_notifier.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Cversion="1.0.0" Csub="shell" condition="device.MIMXRT1064_driver.common">
      <description></description>
      <files>
        <file name="utilities/fsl_shell.c" category="sourceC"/>
        <file name="utilities/fsl_shell.h" category="header"/>
      </files>
    </component>
  </components>
</package>
